---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileName
source: html/49f8a032-d8bc-3f3d-d506-39e51d5f9a26.htm
---
# Autodesk.Revit.DB.IFC.IFCFileWriteOptions.FileName Property

The full file name of the IFC file to be written.

## Syntax (C#)
```csharp
public string FileName { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null